test/app/controllers/pins_controller.rb

INSERT INTO "pins" ("description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "test"], ["user_id", 1], ["created_at", "2015-07-22 08:41:33.911244"], ["updated_at", "2015-07-22 08:41:33.911244"]]
---
  def create
    @pin = current_user.pins.build(pin_params)
    if @pin.save

SELECT  "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_pin
      @pin = Pin.find_by(id: params[:id])